import numpy as np
#大概分个20组吧,每组区间内的人数写成一个列表.横坐标就是1/20=0.05
#(260967,125648,77433,51463,35827,26584,20184,15725,12619,10070,8154,7030,6027,5013,4370,3775,3099,2654,2134,8184)
import matplotlib.pyplot as plt
from pymongo import MongoClient
client = MongoClient('10.8.8.111',27017)
db = client.userValue
coll = db.cache
x = list(np.linspace(0,1,51))
z = list(np.linspace(0,1,11))
index = []
for i in range(50):
    index.append(x[i])
#y = (260967,125648,77433,51463,35827,26584,20184,15725,12619,10070,8154,7030,6027,5013,4370,3775,3099,2654,2134,8184)
#y=[127789, 96959, 68210, 50709, 42948, 34959, 29429, 25033, 21139, 18336, 15723, 13728, 12434, 10843, 9683, 8761, 7797, 7064, 6497, 5790, 5345, 5000, 4435, 4103, 3806, 3504, 3071, 3084, 2839, 2686, 2573, 2291, 2258, 1951, 1967, 1837, 1727, 1619, 1523, 1439, 1307, 1187, 1143, 1116, 1000, 880, 841, 814, 726, 7057]
y=[24, 29, 55, 65, 54, 67, 80, 84, 75, 57, 80, 71, 76, 56, 67, 71, 56, 59, 67, 64, 81, 62, 56, 55, 56, 56, 58, 60, 62, 73, 54, 61, 58, 55, 64, 54, 47, 61, 52, 58, 56, 46, 45, 50, 51, 46, 55, 52, 38, 605]
print(len(y))
opacity = 0.4
rects1 = plt.bar(index, y, 0.02, alpha=opacity, color='b')
plt.xlabel('分区')
plt.ylabel('人数')
plt.title('10月份vip人数分布情况')
plt.xticks(z, tuple(z))
#plt.ylim(0,40)
#plt.legend()
plt.tight_layout()
plt.show()
