from config import *
START = ONLINE_DATE
END = get_week_day(1)
data = [
    ['非人教，北师，华师，苏科四个版本'],
    ['IOS 无任务教材版本付费转化率', '1'],
    ['时期',	'进入付费介绍页UV', '付费', '付费率'],
    ['4.2', 14479, 385, percent(385, 14479)],
    ['4.3', 5894, 171, percent(171, 5894)],
    ['Android 无任务教材版本付费转化率', '1'],
    ['时期', '进入付费介绍页UV', '付费', '付费率'],
    ['4.2', 88402, 838, percent(838, 88402)],
    ['4.3', 24221, 291, percent(291, 24221)],
    ['人教，北师，华师，苏科 四个版本'],
    ['IOS 无任务教材版本付费转化率', '1'],
    ['时期', '进入付费介绍页UV', '付费', '付费率'],
    ['4.2', 76552, 1541, percent(1541, 76552)],
    ['4.3', 28949, 595, percent(595, 28949)],
    ['Android 无任务教材版本付费转化率', '1'],
    ['时期', '进入付费介绍页UV', '付费', '付费率'],
    ['4.2', 582236, 4100, percent(4100, 582236)],
    ['4.3', 153182, 1469, percent(1469, 153182)]
]
write_excel(data, '10', start_2_end(START, END))




