a = ['江苏省徐州市', '江苏省徐州市新沂市', '江苏省', '江苏省苏州市', '江苏省泰州市', '江苏省淮安市', '江苏省镇江市', '江苏省南京市', '江苏省苏州市太仓市', '江苏省无锡市', '江苏省连云港市', '江苏省扬州市', '江苏省南通市', '江苏省盐城市', '江苏省常州市', '江苏省宿迁市', '江苏省苏州市昆山市', '江苏省无锡市锡山区', '江苏省南京市玄武区', '江苏省苏州市吴江市', '江苏省南京市鼓楼区', '江苏省南京市雨花台区', '江苏省南京市下关区', '江苏省淮安市淮阴区', '江苏省徐州市邳州市', '江苏省连云港市灌南县', '江苏省泰州市靖江市', '江苏省盐城市大丰市', '江苏省常州市溧阳市', '江苏省泰州市兴化市', '江苏省盐城市亭湖区', '江苏省扬州市高邮市', '江苏省徐州市铜山县', '江苏省苏州市张家港市', '江苏省盐城市东台市', '江苏省盐城市建湖县', '江苏省南京市浦口区', '江苏省苏州市金阊区', '江苏省苏州市常熟市', '江苏省苏州市吴中区', '江苏省泰州市泰兴市', '江苏省扬州市江都市', '江苏省盐城市射阳县', '江苏省盐城市盐都区', '江苏省连云港市赣榆县', '江苏省南京市白下区', '江苏省无锡市惠山区', '江苏省泰州市姜堰市', '江苏省泰州市海陵区', '江苏省南通市如皋市', '江苏省连云港市东海县', '江苏省宿迁市泗阳县', '江苏省扬州市仪征市', '江苏省盐城市滨海县', '江苏省南通市海门市', '江苏省无锡市宜兴市', '江苏省淮安市涟水县', '江苏省无锡市江阴市', '江苏省镇江市丹阳市', '江苏省常州市金坛市', '江苏省淮安市楚州区', '江苏省镇江市扬中市', '江苏省淮安市金湖县', '江苏省淮安市盱眙县', '江苏省盐城市阜宁县', '江苏省南通市启东市', '江苏省泰安市', '江苏省常州市武进区', '江苏省南通市通州市', '江苏省连云港市新浦区', '江苏省徐州市睢宁县', '江苏省盐城市响水县', '江苏省扬州市宝应县', '江苏省南京市秦淮区', '江苏省南京市六合区', '江苏省宿迁市宿豫区', '江苏省苏州市相城区', '江苏省徐州市沛县', '江苏省南京市江宁区', '江苏省南京市栖霞区', '江苏省宿迁市沭阳县', '江苏省淮安市洪泽县', '江苏省南通市如东县', '江苏省淮安市淮安区', '江苏省镇江市京口区', '江苏省连云港市灌云县', '江苏省宿迁市泗洪县', '江苏省南京市高淳县', '江苏省镇江市丹徒区', '江苏省宿迁市宿城区', '江苏省南通市崇川区', '江苏省淮安市清河区', '江苏省南京市建邺区', '江苏省常州市钟楼区', '江苏省南通市海安县', '江苏省南京市溧水县', '江苏省扬州市江都区', '江苏省徐州市云龙区', '江苏省镇江市句容市', '江苏省南京市大厂区', '江苏省扬州市邗江区', '江苏省苏州市沧浪区', '江苏省泰州市高港区']

from pymongo import MongoClient
from collections import OrderedDict
from bson.objectid import ObjectId
client = MongoClient('10.8.8.111',27017)
db = client.cache
coll = db.userAttr

db_1 = client.eventsV4
coll_1 = db_1.orderEvents

c = OrderedDict()
for i in a:
    c[i]=0
file5=open('v2.csv','w',encoding='utf-8')
user=[]
b = coll_1.find({'eventKey':'paymentSuccess'})
for i in b:
    if 'user' in i:
        if i['user'] not in user:
            user.append(str(i['user']))
d = coll.aggregate([{'$match':{'user':{'$in':user},'location':{'$in':a}}},
                    {'$group':{'_id':'$location','count':{'$sum':1}}}
                    ])
for i in d:
    c[i['_id']]=i['count']
for i in c:
    if c[i] != 0:
        file5.write(str(c[i]))
        file5.write('\n')
    else:
        file5.write('\n')
file5.close()




